Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10C13A.atdf
        <module name="NVMCTRL" id="U2207" version="1.0.7">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0xC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0xC01FFFFFFFFFFFFF"/>
              <param name="FLASH_SIZE" value="8192"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="128"/>
              <param name="PAGES_PR_REGION" value="8"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="1.0.7">
          <instance name="FUSES">
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="PAC" id="U2211" version="1.0.1">
          <instance name="PAC0">
            <register-group name="PAC0" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000000"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
          <instance name="PAC1">
            <register-group name="PAC1" name-in-module="PAC" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000002"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
          <instance name="PAC2">
            <register-group name="PAC2" name-in-module="PAC" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00001000"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2206" version="2.1.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="RESET_N" pad="PA28"/>
            </signals>
            <parameters>
              <param name="CTRL_MCSEL_DFLL48M" value="3"/>
              <param name="CTRL_MCSEL_GCLK" value="0"/>
              <param name="CTRL_MCSEL_OSC8M" value="1"/>
              <param name="CTRL_MCSEL_XOSC" value="2"/>
              <param name="PM_CLK_APB_NUM" value="2"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="NVMCTRL" bit="4"/>
                <clock name="DMAC" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="1.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41004400"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="BITS" value="32"/>
              <param name="DRVSTR" value="1"/>
              <param name="GROUPS" value="1"/>
              <param name="ODRAIN" value="0"/>
              <param name="SLEWLIM" value="0"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
